Documents/бит_РаспределениеАванса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>бит_РаспределениеАванса</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.бит_НачисленияПоУслугамЖКХПоПериоду</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Улица</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокУлиц</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокУслугПоПериоду</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидНачисления</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бит_ВидНачисленияПоУслугамЖКХ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЛицевойСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодВзаиморасчетов</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/бит_РаспределениеАванса/Forms/ФормаДокументаУправляемая/Ext/Form/Module.bsl
#Область ПеременныеМодуля
#КонецОбласти


#Область ПроцедурыИФункцииДляУправленияВнешнимВидомФорм
#КонецОбласти


#Область ПроцедурыОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьКэшЗначений(мКэшЗначений);
	бит_рлс_ОбщегоНазначения.ПроверитьБитыеСсылкиВОбъекте(Объект.Ссылка, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Объект.СуммаДокумента = Объект.СписокУслугПоПериоду.Итог("Сумма");

КонецПроцедуры

#КонецОбласти


#Область ДействияКомандФорм

&НаКлиенте
Процедура Заполнить(Команда)
	
	Если Объект.Проведен Тогда
		ТекстСообщения = НСтр("ru = 'Перед заполнением, необходимо отменить проведение документа.'");
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(ТекстСообщения);
		Возврат;	
	КонецЕсли;
	
	Объект.СписокУслугПоПериоду.Очистить(); //Чтобы меньше пересылать на сервер при конвертации	
	ЗаполнитьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере();
	
	ДокументОбъект = ДанныеФормыВЗначение(Объект, Тип("ДокументОбъект.бит_РаспределениеАванса"));
	
	ДокументОбъект.ЗаполнитьСписокУслуг();
	
	ЗначениеВДанныеФормы(ДокументОбъект, Объект);
	
КонецПроцедуры

#КонецОбласти


#Область ПроцедурыОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	Если Объект.СписокУслугПоПериоду.Количество() > 0 Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ОрганизацияПриИзмененииЗавершение", ЭтотОбъект), "Табличная часть будет очищена. Продолжить?", РежимДиалогаВопрос.ДаНет);
		Возврат;
	КонецЕсли;
	
	//ОрганизацияПриИзмененииФрагмент();
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзмененииЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Ответ = РезультатВопроса;
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Объект.Организация = мКэшЗначений.мОрганизация;
		Возврат;
	КонецЕсли;
	
	Объект.СписокУслугПоПериоду.Очистить();
	//ОрганизацияПриИзмененииФрагмент();
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	мКэшЗначений.мОрганизация = Объект.Организация;
	
КонецПроцедуры

&НаКлиенте
Процедура УлицаПриИзменении(Элемент)
	
	Если Объект.СписокУслугПоПериоду.Количество() > 0 Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("УлицаПриИзмененииЗавершение", ЭтотОбъект), "Табличная часть будет очищена. Продолжить?", РежимДиалогаВопрос.ДаНет);
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УлицаПриИзмененииЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Ответ = РезультатВопроса;
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Объект.Улица = мКэшЗначений.мУлица;
		Возврат;
	КонецЕсли;
	
	Объект.СписокУслугПоПериоду.Очистить();
	//ОрганизацияПриИзмененииФрагмент();
	
КонецПроцедуры

&НаКлиенте
Процедура УлицаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	мКэшЗначений.мУлица = Объект.Улица;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗданиеПриИзменении(Элемент)
	
	Если Объект.СписокУслугПоПериоду.Количество() > 0 Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ЗданиеПриИзмененииЗавершение", ЭтотОбъект), "Табличная часть будет очищена. Продолжить?", РежимДиалогаВопрос.ДаНет);
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗданиеПриИзмененииЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Ответ = РезультатВопроса;
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Объект.Здание = мКэшЗначений.мЗдание;
		Возврат;
	КонецЕсли;
	
	Объект.СписокУслугПоПериоду.Очистить();
	//ОрганизацияПриИзмененииФрагмент();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗданиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	мКэшЗначений.мЗдание = Объект.Здание;
	
КонецПроцедуры


#КонецОбласти


#Область ПроцедурыОбработчикиСобытийТабличногоПоля

&НаКлиенте
Процедура СписокУслугПоПериодуЛицевойСчетНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокУслугПоПериодуЛицевойСчетОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

#КонецОбласти


#Область ПрочиеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьКэшЗначений(КэшированныеЗначения)
	
	КэшированныеЗначения = Новый Структура;
	
	КэшированныеЗначения.Вставить("ПредставлениеОбъекта", Объект.Ссылка.Метаданные().ПредставлениеОбъекта);
	КэшированныеЗначения.Вставить("мТекущаяДатаДокумента", Объект.Дата);
	
	КэшированныеЗначения.Вставить("мОрганизация",		 Объект.Организация);
	КэшированныеЗначения.Вставить("мЗдание",			 Объект.Здание);
	КэшированныеЗначения.Вставить("мУлица",				 Объект.Улица);
	КэшированныеЗначения.Вставить("мТекущийЛицевойСчет", Неопределено);	
	КэшированныеЗначения.Вставить("мЛицевойСчет",		 Неопределено);
	КэшированныеЗначения.Вставить("мСумма",				 Неопределено);
	КэшированныеЗначения.Вставить("ВыбЗначение",		 Неопределено);
	
КонецПроцедуры // ЗаполнитьКэшЗначений()

#КонецОбласти
